# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [6]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [40]:
baby_names = baby_names[['Name', 'Year', 'Gender', 'State', 'Count']]
baby_names

          Name  Year Gender State  Count
33       Riley  2004      F    AK     17
255      Riley  2005      F    AK     13
530      Riley  2006      F    AK      8
669      Riley  2007      F    AK     17
871      Riley  2008      F    AK     17
...        ...   ...    ...   ...    ...
1015597  Riley  2010      M    WY     11
1015769  Riley  2011      M    WY     12
1015973  Riley  2012      M    WY      8
1016154  Riley  2013      M    WY      7
1016273  Riley  2014      M    WY     12

[1112 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [15]:
nmale = np.sum(baby_names.Gender == 'M')
nfem = np.sum(baby_names.Gender == 'F')
print(nmale-nfem) # 100k more females

-101297

### Step 7. Group the dataset by name and assign to names

In [18]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [33]:
len(names) # I don't really get why python has this built in len() but you can't call .length(). I mean, I know why, but like — why would they do it like that.

17632

In [34]:
baby_names.Name.unique().size # alternatively, avoiding the groupby

17632

In [39]:
names.sum()

           Year  Count
Name
Aaban      4027     12
Aadan      8039     23
Aadarsh    2009      5
Aaden    393963   3426
Aadhav     2014      6
...         ...    ...
Zyra      14085     42
Zyrah      4024     11
Zyren      2013      6
Zyria     20089     59
Zyriah    18087     58

[17632 rows x 2 columns]

### Step 9. What is the name with most occurrences?

In [45]:
counts = names.sum().Count.sort_values() # Jacob
counts

Name
Destenie         5
Janisha          5
Lizvet           5
Arsalan          5
Janira           5
             ...
Isabella    204798
Ethan       209277
Michael     214405
Emma        214852
Jacob       242874
Name: Count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [46]:
sum(counts == 5)

2578

### Step 11. What is the median name occurrence?

In [47]:
np.median(counts)

49.0

### Step 12. What is the standard deviation of names?

In [48]:
np.std(counts)

11005.757358500687

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [51]:
counts.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64